       IDENTIFICATION DIVISION.
       PROGRAM-ID. BONJOUR-DJOULIE.
       AUTHOR. GHANI.
       DATE-WRITTEN. 2025-04-09.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. THINKPAD.
       OBJECT-COMPUTER. X395.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
   

       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           DISPLAY "Bonjour Djoulie!".
           STOP RUN.


