       IDENTIFICATION DIVISION.
       PROGRAM-ID. ENVIRONNEMENT-EXEMPLE.
       AUTHOR. GHANI.
       DATE-WRITTEN. 2025-04-17.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER. IBM-SYSTEM-370.
           OBJECT-COMPUTER. IBM-SYSTEM-370.
           SPECIAL-NAMES.
               DECIMAL-POINT IS COMMA.
               CONSOLE CONSOLE IS TERMINAL.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FICHIER-ENTREE
               ASSIGN TO DISK "donnees_entree.txt"
               ORGANIZATION IS LINE SEQUENTIAL
               FILE STATUS IS WS-FICHIER-ENTREE-STATUS.
           SELECT FICHIER-SORTIE
               ASSIGN TO DISK "rapport.txt"
               ORGANIZATION IS LINE SEQUENTIAL
               FILE STATUS IS WS-FICHIER-SORTIE-STATUS.

       DATA DIVISION.
       FILE SECTION.
       FD FICHIER-ENTREE.
       01 ENR-ENTREE PIC X(80).
       FD FICHIER-SORTIE.
       01 ENR-SORTIE PIC X(80).
       WORKING-STORAGE SECTION.
       01 WS-FICHIER-ENTREE-STATUS PIC XX VALUE "00".
       01 WS-FICHIER-SORTIE-STATUS PIC XX VALUE "00".
       01 ENREGISTREMENT-ENTREE PIC X(80).

       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           OPEN INPUT FICHIER-ENTREE.
           OPEN OUTPUT FICHIER-SORTIE.

           PERFORM UNTIL WS-FICHIER-ENTREE-STATUS NOT = "00"
               READ FICHIER-ENTREE INTO ENREGISTREMENT-ENTREE
                   AT END
                       MOVE "10" TO WS-FICHIER-ENTREE-STATUS
               END-READ
               IF WS-FICHIER-ENTREE-STATUS = "00" THEN
                   DISPLAY "Ligne lue : " ENREGISTREMENT-ENTREE
                   MOVE ENREGISTREMENT-ENTREE TO ENR-SORTIE
                   WRITE ENR-SORTIE AFTER ADVANCING 1 LINE
               END-IF
           END-PERFORM.

           CLOSE FICHIER-ENTREE.
           CLOSE FICHIER-SORTIE.

           STOP RUN.