       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALUTLEPEUPLE.
       AUTHOR. GHANI.
       DISPLAY. "Salut tout le monde".
       STOP RUN.


           