           IDENTIFICATION DIVISION.
           PROGRAM-ID. SALUTLEPEUPLE.
           AUTHOR. GHANI.
           DISPLAY. "Salut tout le mond".
           STOP RUN.


           