           IDENTIFICATION DIVISION.
           PROGRAM-ID. SALUTLEPEUPLE.
           AUTHOR. GHANI.
           DISPLAY. "Salut tout le monde cest LaSalle".
           STOP RUN.


           