       IDENTIFICATION DIVISION.
       PROGRAM-ID. SALUTATION-PERSONNELLE.
       AUTHOR. GHANI.
       DATE-WRITTEN. 2025-04-16.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. THINKPAD.
       OBJECT-COMPUTER. X395.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NOM-UTILISATEUR PIC X(30).

       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           DISPLAY "Quel est votre nom ?".
           ACCEPT NOM-UTILISATEUR.
           DISPLAY "Bonjour ", NOM-UTILISATEUR, "!".
           STOP RUN.